<template>
  <div>
    Polyfill
  </div>
</template>

<script>
// TODO 범위 선택기(Area Selector)
// naverMap 페이지를 만들어서 관련 기능을 시연하는 페이지를 만들자(BaseComponent도 비슷하게 만들어서 웹으로 올리자)
// 좌표가 폐곡선(closed path)를 이루는 경우, 이 영역을 포함하는 h3Index를 구해서 화면에 표현
// 그럼 폐곡선의 좌표는 어떻게 받을까? 좌표 클릭은 지도로부터 props로 받고 있음
// 폐곡선을 표시하는 것이 도움이 될 것으로 생각됨. 네이버 지도에서 이 기능을 쓰려면?
// 도형을 직접 그릴 수 있는 수단을 제공해야 함
// 1. 네이버 지도를 이용하는 방법
// 1-1. 클릭한 지점 폴리곤 연결하기(이거 쓰자!)
// 근데 클릭한 지점들을 편집하는 것은 불가. 처음부터 다시 해야함.
// https://navermaps.github.io/maps.js.ncp/docs/tutorial-polygon-dynamic.example.html
// 여기에 마커를 클릭 드래그할 수 있는 기능을 붙이면 편집이 가능!
// 기존 h3Index들을 마커로 변환하는 기능을 제공하면 편하겠지만...넓은 지역일 경우, 마커를 한꺼번에 그릴수 없다는 단점이 있음.
// 사용자 입장에서는 직선을 그어서 영역을 확정하는 것이 가장 직관적(1순위)
// 도형을 그어서 영역을 확정하는 것도 필요(2순위)
// 위 2가지 추가 방법은 제외할 때도 사용할 수 있게 해주자
// 어떤 방식으로 영역을 선택할지 결정하는 것은 UI를 제공해줄 필요가 있다
// 그리고 클릭하는 포인트 기준으로 폴리곤, 도형으로 영역을 선택하면 된다
// 입력하는 도중에 중단하고 다시 이어서 하려면?
export default {

};
</script>

<style lang="scss" scoped>

</style>
